// Які існують типи даних у Javascript?
// у Javascript є два типи даних: ссилочні та примитиви. у примитивах їх 7: 
// string, numbers, (BigInt), boolean, undefined, null та символ
// у ссилочних їх один: obj та окремі випадки object function, array
// У чому різниця між == і ===?
// == це порівняння без приводу типів, а === з привидами типів
// Що таке оператор?
// це внутрішньо вбудована функція, що робить дії та повертає результат. таким прикладом є оператор присвоєння


// Реалізувати просту програму на Javascript, яка взаємодіятиме з користувачем за допомогою модальних вікон браузера - alert, prompt, confirm. 
// Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

// Технічні вимоги:
// Отримати за допомогою модального вікна браузера дані користувача: ім'я та вік.
// Якщо вік менше 18 років - показати на екрані повідомлення: You are not allowed to visit this website.
// Якщо вік від 18 до 22 років (включно) – показати вікно з наступним повідомленням: Are you sure you want to continue? і кнопками Ok, Cancel. Якщо користувач натиснув Ok, показати на екрані повідомлення: Welcome,  + ім'я користувача. Якщо користувач натиснув Cancel, показати на екрані повідомлення: You are not allowed to visit this website.
// Якщо вік більше 22 років – показати на екрані повідомлення: Welcome,  + ім'я користувача.
// Обов'язково необхідно використовувати синтаксис ES6 (ES2015) для створення змінних.
// Після введення даних додати перевірку їхньої коректності. Якщо користувач не ввів ім'я, або при введенні віку вказав не число - запитати ім'я та вік наново (при цьому дефолтним значенням для кожної зі змінних має бути введена раніше інформація)


const userName = prompt("What is your name?");
let age = null

do {
    age = +prompt('What is your age?');
} while (!age || Number.isNaN(age));

if (age < 18) {
    alert('You are not allowed to visit this website');
}  else if (age >= 18 && age <= 21) {
    let result = confirm('Are you sure you want to continue?');
    if (result) {
        alert(`Welcome, ${userName}!`);
    } else {
        alert('You are not allowed to visit this website');
    }
}else {
    alert(`Welcome, ${userName}!`);
}